ViacheslavMezentsev/demo-stm32-cmake/stm32h5xx/03-blink/STM32H503.svd
          <register>
            <name>DBGMCU_PIDR0</name>
            <displayName>DBGMCU_PIDR0</displayName>
            <description>DBGMCU CoreSight peripheral identity register 0</description>
            <addressOffset>0xFE0</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>PARTNUM</name>
                <description>part number bits [7:0]</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x00</name>
                    <description>DBGMCU part number</description>
                    <value>0x00</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>DBGMCU_PIDR1</name>
            <displayName>DBGMCU_PIDR1</displayName>
            <description>DBGMCU CoreSight peripheral identity register 1</description>
            <addressOffset>0xFE4</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>PARTNUM</name>
                <description>part number bits [11:8]</description>
                <bitOffset>0</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>DBGMCU part number</description>
                    <value>0x0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>JEP106ID</name>
                <description>JEP106 identity code bits [3:0]</description>
                <bitOffset>4</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>STMicroelectronics JEDEC code</description>
                    <value>0x0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>DBGMCU_PIDR2</name>
            <displayName>DBGMCU_PIDR2</displayName>
            <description>DBGMCU CoreSight peripheral identity register 2</description>
            <addressOffset>0xFE8</addressOffset>
            <size>0x20</size>
            <resetValue>0x0000000A</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>JEP106ID</name>
                <description>JEP106 identity code bits [6:4]</description>
                <bitOffset>0</bitOffset>
                <bitWidth>3</bitWidth>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x2</name>
                    <description>STMicroelectronics JEDEC code</description>
                    <value>0x2</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>JEDEC</name>
                <description>JEDEC assigned value</description>
                <bitOffset>3</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>designer identification specified by JEDEC</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>REVISION</name>
                <description>component revision number</description>
                <bitOffset>4</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>r0p0</description>
                    <value>0x0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>DBGMCU_PIDR3</name>
            <displayName>DBGMCU_PIDR3</displayName>
            <description>DBGMCU CoreSight peripheral identity register 3</description>
            <addressOffset>0xFEC</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>CMOD</name>
                <description>customer modified</description>
                <bitOffset>0</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>no customer modifications</description>
                    <value>0x0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>REVAND</name>
                <description>metal fix version</description>
                <bitOffset>4</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>no metal fix</description>
                    <value>0x0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>DBGMCU_CIDR0</name>
            <displayName>DBGMCU_CIDR0</displayName>
            <description>DBGMCU CoreSight component identity register 0</description>
            <addressOffset>0xFF0</addressOffset>
            <size>0x20</size>
            <resetValue>0x0000000D</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>PREAMBLE</name>
                <description>component identification bits [7:0]</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0D</name>
                    <description>common identification value</description>
                    <value>0x0D</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>DBGMCU_CIDR1</name>
            <displayName>DBGMCU_CIDR1</displayName>
            <description>DBGMCU CoreSight component identity register 1</description>
            <addressOffset>0xFF4</addressOffset>
            <size>0x20</size>
            <resetValue>0x000000F0</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>PREAMBLE</name>
                <description>component identification bits [11:8]</description>
                <bitOffset>0</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>common identification value</description>
                    <value>0x0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>CLASS</name>
                <description>component identification bits [15:12] - component class</description>
                <bitOffset>4</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0xF</name>
                    <description>Non-CoreSight component</description>
                    <value>0xF</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>DBGMCU_CIDR2</name>
            <displayName>DBGMCU_CIDR2</displayName>
            <description>DBGMCU CoreSight component identity register 2</description>
            <addressOffset>0xFF8</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000005</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>PREAMBLE</name>
                <description>component identification bits [23:16]</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x05</name>
                    <description>common identification value</description>
                    <value>0x05</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>DBGMCU_CIDR3</name>
            <displayName>DBGMCU_CIDR3</displayName>
            <description>DBGMCU CoreSight component identity register 3</description>
            <addressOffset>0xFFC</addressOffset>
            <size>0x20</size>
            <resetValue>0x000000B1</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>PREAMBLE</name>
                <description>component identification bits [31:24]</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0xB1</name>
                    <description>common identification value</description>
                    <value>0xB1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
