ViacheslavMezentsev/demo-stm32-cmake/stm32h5xx/03-blink/STM32H503.svd
          <register>
            <name>FLASH_NSBOOTR_PRG</name>
            <displayName>FLASH_NSBOOTR_PRG</displayName>
            <description>FLASH non-secure unique boot entry address </description>
            <addressOffset>0x84</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00000000</resetMask>
            <fields>
              <field>
                <name>NSBOOT_LOCK</name>
                <description>A field locking the values of SWAP_BANK, and NSBOOTADD settings.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0xC3</name>
                    <description>The SWAP_BANK and NSBOOTADD can still be modified following their individual rules.</description>
                    <value>0xC3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0xB4</name>
                    <description>The NSBOOTADD and SWAP_BANK are frozen. </description>
                    <value>0xB4</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>NSBOOTADD</name>
                <description>Unique boot entry address
These bits allow configuring the BOOT address</description>
                <bitOffset>8</bitOffset>
                <bitWidth>24</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>FLASH_OTPBLR_CUR</name>
            <displayName>FLASH_OTPBLR_CUR</displayName>
            <description>FLASH non-secure OTP block lock </description>
            <addressOffset>0x90</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00000000</resetMask>
            <fields>
              <field>
                <name>LOCKBL</name>
                <description>OTP block lock
Block n corresponds to OTP 16-bit word 32 x n to 32 x n + 31.
LOCKBL[n] = 1 indicates that all OTP 16-bit words in OTP Block n are locked and attempt to program them results in WRPERR.
LOCKBL[n] = 0 indicates that all OTP 16-bit words in OTP Block n are not locked.
When one block is locked, it's not possible to remove the write protection.
Also if not locked, it is not possible to erase OTP words.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>FLASH_OTPBLR_PRG</name>
            <displayName>FLASH_OTPBLR_PRG</displayName>
            <description>FLASH non-secure OTP block lock </description>
            <addressOffset>0x94</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00000000</resetMask>
            <fields>
              <field>
                <name>LOCKBL</name>
                <description>OTP block lock
Block n corresponds to OTP 16-bit word 32 x n to 32 x n + 31.
LOCKBL[n] = 1 indicates that all OTP 16-bit words in OTP Block n are locked and attempt to program them results in WRPERR.
LOCKBL[n] = 0 indicates that all OTP 16-bit words in OTP Block n are not locked.
When one block is locked, it is not possible to remove the write protection.
LOCKBL bits can be set if the corresponding bit in FLASH_OTPBLR_CUR is cleared.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>FLASH_PRIVBB1R</name>
            <displayName>FLASH_PRIVBB1R</displayName>
            <description>FLASH privilege register for bank 1 </description>
            <addressOffset>0xc0</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>PRIVBB1</name>
                <description>Privileged / unprivileged 8 Kbytes Flash Bank1 sector attribute (y = 0 to 7)</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>sectors y in bank 1 is non privileged</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>sector y in bank 1 is privileged</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>FLASH_WRPSGN1R_CUR</name>
            <displayName>FLASH_WRPSGN1R_CUR</displayName>
            <description>FLASH write sector protection for Bank1	</description>
            <addressOffset>0xe8</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00000000</resetMask>
            <fields>
              <field>
                <name>WRPSG1</name>
                <description>Bank1 sector protection option status byte
Setting WRPSG1 bits to 0 write protects the corresponding sectors in bank 1 (0: write protected; 1: not write protected)</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>FLASH_WRPSGN1R_PRG</name>
            <displayName>FLASH_WRPSGN1R_PRG</displayName>
            <description>FLASH write sector protection for Bank1	</description>
            <addressOffset>0xec</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00000000</resetMask>
            <fields>
              <field>
                <name>WRPSG1</name>
                <description>Bank1 sector protection option status byte
Setting WRPSG1 bits to 0 write protects the corresponding sectors in bank 1 (0: write protected; 1: not write protected)</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>FLASH_HDP1R_CUR</name>
            <displayName>FLASH_HDP1R_CUR</displayName>
            <description>FLASH HDP Bank1 register </description>
            <addressOffset>0xf8</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00000000</resetMask>
            <fields>
              <field>
                <name>HDP1_STRT</name>
                <description>HDPL barrier start set in number of 8 Kbytes sectors</description>
                <bitOffset>0</bitOffset>
                <bitWidth>3</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>HDP1_END</name>
                <description>HDPL barrier end set in number of 8 Kbytes sectors</description>
                <bitOffset>16</bitOffset>
                <bitWidth>3</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>FLASH_HDP1R_PRG</name>
            <displayName>FLASH_HDP1R_PRG</displayName>
            <description>FLASH HDP Bank1 register </description>
            <addressOffset>0xfc</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00000000</resetMask>
            <fields>
              <field>
                <name>HDP1_STRT</name>
                <description>Bank 1 HDPL barrier start set in number of 8 Kbytes sectors</description>
                <bitOffset>0</bitOffset>
                <bitWidth>3</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>HDP1_END</name>
                <description>Bank 1 HDPL barrier end set in number of 8 Kbytes sectors</description>
                <bitOffset>16</bitOffset>
                <bitWidth>3</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>FLASH_ECCCORR</name>
            <displayName>FLASH_ECCCORR</displayName>
            <description>FLASH Flash ECC correction register </description>
            <addressOffset>0x100</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>ADDR_ECC</name>
                <description>ECC error address
When an ECC error occurs (for single correction) during a read operation, the ADDR_ECC contains the address that generated the error.
ADDR_ECC is reset when the flag error is reset.
The embedded Flash memory programs the address in this register only when no ECC error flags are set. This means that only the first address that generated an ECC error is saved.
The address in ADDR_ECC is relative to the Flash memory area where the error occurred (user Flash memory, system Flash memory, data area, read-only/OTP area).</description>
                <bitOffset>0</bitOffset>
                <bitWidth>16</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>BK_ECC</name>
                <description>ECC bank flag for corrected ECC error
It indicates which bank is concerned by ECC error</description>
                <bitOffset>22</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>SYSF_ECC</name>
                <description>ECC flag for corrected ECC error in system FLASH
It indicates if system Flash memory is concerned by ECC error.</description>
                <bitOffset>23</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>OTP_ECC</name>
                <description>OTP ECC error bit
This bit is set to 1 when one single ECC correction occurred during the last successful read operation from the read-only/ OTP area. The address of the ECC error is available in ADDR_ECC bitfield.</description>
                <bitOffset>24</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>ECCCIE</name>
                <description>ECC single correction error interrupt enable bit When ECCCIE bit is set to 1, an interrupt is generated when an ECC single correction error occurs during a read operation.</description>
                <bitOffset>25</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>no interrupt generated when an ECC single correction error occurs </description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>non-secure interrupt generated when an ECC single correction error occurs </description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>ECCC</name>
                <description>ECC correction set by hardware when single ECC error has been detected and corrected.
Cleared by writing 1.</description>
                <bitOffset>30</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>FLASH_ECCDETR</name>
            <displayName>FLASH_ECCDETR</displayName>
            <description>FLASH ECC detection register </description>
            <addressOffset>0x104</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>ADDR_ECC</name>
                <description>ECC error address
When an ECC error occurs (double detection) during a read operation, the ADDR_ECC contains the address that generated the error.
ADDR_ECC is reset when the flag error is reset.
The embedded Flash memory programs the address in this register only when no ECC error flags are set. This means that only the first address that generated an double ECC error is saved.
The address in ADDR_ECC is relative to the Flash memory area where the error occurred (user Flash memory, system Flash memory, data area, read-only/OTP area).</description>
                <bitOffset>0</bitOffset>
                <bitWidth>16</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>BK_ECC</name>
                <description>ECC fail bank for double ECC Error
It indicates which bank is concerned by ECC error</description>
                <bitOffset>22</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>SYSF_ECC</name>
                <description>ECC fail for double ECC error in system Flash memory
It indicates if system Flash memory is concerned by ECC error.</description>
                <bitOffset>23</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>OTP_ECC</name>
                <description>OTP ECC error bit
This bit is set to 1 when double ECC detection occurred during the last read operation from the read-only/ OTP area. The address of the ECC error is available in ADDR_ECC bit field.</description>
                <bitOffset>24</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>ECCD</name>
                <description>ECC detection set by hardware when two ECC error has been detected.
When this bit is set, a NMI is generated.
Cleared by writing 1. Needs to be cleared in order to detect subsequent double ECC errors.</description>
                <bitOffset>31</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>FLASH_ECCDR</name>
            <displayName>FLASH_ECCDR</displayName>
            <description>FLASH ECC data </description>
            <addressOffset>0x108</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>DATA_ECC</name>
                <description>ECC error data
When an double detection ECC error occurs on special areas with 6-bit ECC on 16-bit of data (data area, read-only/OTP area), the failing data is read to this register.
By checking if it is possible to determine whether the failure was on a real data, or due to access to uninitialized memory.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>16</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>FLASH_WRPSGN2R_CUR</name>
            <displayName>FLASH_WRPSGN2R_CUR</displayName>
            <description>FLASH write sector protection for Bank2	</description>
            <addressOffset>0x1e8</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00000000</resetMask>
            <fields>
              <field>
                <name>WRPSG2</name>
                <description>Bank2 sector protection option status byte
Setting WRPSG2 bits to 0 write protects the corresponding sectors in bank 2 (0: write protected; 1: not write protected)</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>FLASH_WRPSGN2R_PRG</name>
            <displayName>FLASH_WRPSGN2R_PRG</displayName>
            <description>FLASH write sector protection for Bank2	</description>
            <addressOffset>0x1ec</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00000000</resetMask>
            <fields>
              <field>
                <name>WRPSG2</name>
                <description>Bank2 sector protection option status byte
Setting WRPSG2 bits to 0 write protects the corresponding sectors in bank 2 (0: write protected; 1: not write protected)</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>FLASH_HDP2R_CUR</name>
            <displayName>FLASH_HDP2R_CUR</displayName>
            <description>FLASH HDP Bank2 register </description>
            <addressOffset>0x1f8</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00000000</resetMask>
            <fields>
              <field>
                <name>HDP2_STRT</name>
                <description>Bank 2 HDPL barrier start set in number of 8 Kbytes sectors</description>
                <bitOffset>0</bitOffset>
                <bitWidth>3</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>HDP2_END</name>
                <description>Bank 2 HDPL barrier end set in number of 8 Kbytes sectors</description>
                <bitOffset>16</bitOffset>
                <bitWidth>3</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>FLASH_HDP2R_PRG</name>
            <displayName>FLASH_HDP2R_PRG</displayName>
            <description>FLASH HDP Bank2 register </description>
            <addressOffset>0x1fc</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00000000</resetMask>
            <fields>
              <field>
                <name>HDP2_STRT</name>
                <description>Bank 2 HDPL barrier start set in number of 8 Kbytes sectors</description>
                <bitOffset>0</bitOffset>
                <bitWidth>3</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>HDP2_END</name>
                <description>Bank 2 HDPL barrier end set in number of 8 Kbytes sectors</description>
                <bitOffset>16</bitOffset>
                <bitWidth>3</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
