ViacheslavMezentsev/demo-stm32-cmake/stm32h5xx/03-blink/STM32H503.svd
          <register>
            <name>HASH_CSR23</name>
            <displayName>HASH_CSR23</displayName>
            <description>HASH context swap register 23</description>
            <addressOffset>0x154</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>CS23</name>
                <description>Context swap x
Refer to Section 24.7.7: HASH context swap registers introduction.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>HASH_CSR24</name>
            <displayName>HASH_CSR24</displayName>
            <description>HASH context swap register 24</description>
            <addressOffset>0x158</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>CS24</name>
                <description>Context swap x
Refer to Section 24.7.7: HASH context swap registers introduction.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>HASH_CSR25</name>
            <displayName>HASH_CSR25</displayName>
            <description>HASH context swap register 25</description>
            <addressOffset>0x15C</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>CS25</name>
                <description>Context swap x
Refer to Section 24.7.7: HASH context swap registers introduction.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>HASH_CSR26</name>
            <displayName>HASH_CSR26</displayName>
            <description>HASH context swap register 26</description>
            <addressOffset>0x160</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>CS26</name>
                <description>Context swap x
Refer to Section 24.7.7: HASH context swap registers introduction.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>HASH_CSR27</name>
            <displayName>HASH_CSR27</displayName>
            <description>HASH context swap register 27</description>
            <addressOffset>0x164</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>CS27</name>
                <description>Context swap x
Refer to Section 24.7.7: HASH context swap registers introduction.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>HASH_CSR28</name>
            <displayName>HASH_CSR28</displayName>
            <description>HASH context swap register 28</description>
            <addressOffset>0x168</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>CS28</name>
                <description>Context swap x
Refer to Section 24.7.7: HASH context swap registers introduction.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>HASH_CSR29</name>
            <displayName>HASH_CSR29</displayName>
            <description>HASH context swap register 29</description>
            <addressOffset>0x16C</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>CS29</name>
                <description>Context swap x
Refer to Section 24.7.7: HASH context swap registers introduction.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>HASH_CSR30</name>
            <displayName>HASH_CSR30</displayName>
            <description>HASH context swap register 30</description>
            <addressOffset>0x170</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>CS30</name>
                <description>Context swap x
Refer to Section 24.7.7: HASH context swap registers introduction.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>HASH_CSR31</name>
            <displayName>HASH_CSR31</displayName>
            <description>HASH context swap register 31</description>
            <addressOffset>0x174</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>CS31</name>
                <description>Context swap x
Refer to Section 24.7.7: HASH context swap registers introduction.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>HASH_CSR32</name>
            <displayName>HASH_CSR32</displayName>
            <description>HASH context swap register 32</description>
            <addressOffset>0x178</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>CS32</name>
                <description>Context swap x
Refer to Section 24.7.7: HASH context swap registers introduction.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>HASH_CSR33</name>
            <displayName>HASH_CSR33</displayName>
            <description>HASH context swap register 33</description>
            <addressOffset>0x17C</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>CS33</name>
                <description>Context swap x
Refer to Section 24.7.7: HASH context swap registers introduction.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>HASH_CSR34</name>
            <displayName>HASH_CSR34</displayName>
            <description>HASH context swap register 34</description>
            <addressOffset>0x180</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>CS34</name>
                <description>Context swap x
Refer to Section 24.7.7: HASH context swap registers introduction.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>HASH_CSR35</name>
            <displayName>HASH_CSR35</displayName>
            <description>HASH context swap register 35</description>
            <addressOffset>0x184</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>CS35</name>
                <description>Context swap x
Refer to Section 24.7.7: HASH context swap registers introduction.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>HASH_CSR36</name>
            <displayName>HASH_CSR36</displayName>
            <description>HASH context swap register 36</description>
            <addressOffset>0x188</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>CS36</name>
                <description>Context swap x
Refer to Section 24.7.7: HASH context swap registers introduction.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>HASH_CSR37</name>
            <displayName>HASH_CSR37</displayName>
            <description>HASH context swap register 37</description>
            <addressOffset>0x18C</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>CS37</name>
                <description>Context swap x
Refer to Section 24.7.7: HASH context swap registers introduction.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>HASH_CSR38</name>
            <displayName>HASH_CSR38</displayName>
            <description>HASH context swap register 38</description>
            <addressOffset>0x190</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>CS38</name>
                <description>Context swap x
Refer to Section 24.7.7: HASH context swap registers introduction.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>HASH_CSR39</name>
            <displayName>HASH_CSR39</displayName>
            <description>HASH context swap register 39</description>
            <addressOffset>0x194</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>CS39</name>
                <description>Context swap x
Refer to Section 24.7.7: HASH context swap registers introduction.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>HASH_CSR40</name>
            <displayName>HASH_CSR40</displayName>
            <description>HASH context swap register 40</description>
            <addressOffset>0x198</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>CS40</name>
                <description>Context swap x
Refer to Section 24.7.7: HASH context swap registers introduction.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>HASH_CSR41</name>
            <displayName>HASH_CSR41</displayName>
            <description>HASH context swap register 41</description>
            <addressOffset>0x19C</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>CS41</name>
                <description>Context swap x
Refer to Section 24.7.7: HASH context swap registers introduction.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>HASH_CSR42</name>
            <displayName>HASH_CSR42</displayName>
            <description>HASH context swap register 42</description>
            <addressOffset>0x1A0</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>CS42</name>
                <description>Context swap x
Refer to Section 24.7.7: HASH context swap registers introduction.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>HASH_CSR43</name>
            <displayName>HASH_CSR43</displayName>
            <description>HASH context swap register 43</description>
            <addressOffset>0x1A4</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>CS43</name>
                <description>Context swap x
Refer to Section 24.7.7: HASH context swap registers introduction.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>HASH_CSR44</name>
            <displayName>HASH_CSR44</displayName>
            <description>HASH context swap register 44</description>
            <addressOffset>0x1A8</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>CS44</name>
                <description>Context swap x
Refer to Section 24.7.7: HASH context swap registers introduction.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>HASH_CSR45</name>
            <displayName>HASH_CSR45</displayName>
            <description>HASH context swap register 45</description>
            <addressOffset>0x1AC</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>CS45</name>
                <description>Context swap x
Refer to Section 24.7.7: HASH context swap registers introduction.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>HASH_CSR46</name>
            <displayName>HASH_CSR46</displayName>
            <description>HASH context swap register 46</description>
            <addressOffset>0x1B0</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>CS46</name>
                <description>Context swap x
Refer to Section 24.7.7: HASH context swap registers introduction.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>HASH_CSR47</name>
            <displayName>HASH_CSR47</displayName>
            <description>HASH context swap register 47</description>
            <addressOffset>0x1B4</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>CS47</name>
                <description>Context swap x
Refer to Section 24.7.7: HASH context swap registers introduction.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>HASH_CSR48</name>
            <displayName>HASH_CSR48</displayName>
            <description>HASH context swap register 48</description>
            <addressOffset>0x1B8</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>CS48</name>
                <description>Context swap x
Refer to Section 24.7.7: HASH context swap registers introduction.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>HASH_CSR49</name>
            <displayName>HASH_CSR49</displayName>
            <description>HASH context swap register 49</description>
            <addressOffset>0x1BC</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>CS49</name>
                <description>Context swap x
Refer to Section 24.7.7: HASH context swap registers introduction.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>HASH_CSR50</name>
            <displayName>HASH_CSR50</displayName>
            <description>HASH context swap register 50</description>
            <addressOffset>0x1C0</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>CS50</name>
                <description>Context swap x
Refer to Section 24.7.7: HASH context swap registers introduction.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>HASH_CSR51</name>
            <displayName>HASH_CSR51</displayName>
            <description>HASH context swap register 51</description>
            <addressOffset>0x1C4</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>CS51</name>
                <description>Context swap x
Refer to Section 24.7.7: HASH context swap registers introduction.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>HASH_CSR52</name>
            <displayName>HASH_CSR52</displayName>
            <description>HASH context swap register 52</description>
            <addressOffset>0x1C8</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>CS52</name>
                <description>Context swap x
Refer to Section 24.7.7: HASH context swap registers introduction.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>HASH_CSR53</name>
            <displayName>HASH_CSR53</displayName>
            <description>HASH context swap register 53</description>
            <addressOffset>0x1CC</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>CS53</name>
                <description>Context swap x
Refer to Section 24.7.7: HASH context swap registers introduction.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>HASH_HR0</name>
            <displayName>HASH_HR0</displayName>
            <description>HASH digest register 0</description>
            <addressOffset>0x310</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>H0</name>
                <description>Hash data x
Refer to Section 24.7.4: HASH digest registers introduction.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
