ViacheslavMezentsev/demo-stm32-cmake/stm32h5xx/03-blink/STM32H503.svd
        </registers>
    </peripheral>
	<peripheral>
        <name>SBS</name>
        <description>System configuration, boot and security</description>
		<groupName>SBS</groupName>
        <baseAddress>0x44000400</baseAddress>
		<addressBlock>
          <offset>0x0</offset>
          <size>0x150</size>
          <usage>registers</usage>
        </addressBlock>
        <registers>
          <register>
            <name>SBS_HDPLCR</name>
            <displayName>SBS_HDPLCR</displayName>
            <description>SBS temporal isolation control register</description>
            <addressOffset>0x010</addressOffset>
            <size>0x20</size>
            <resetValue>0x000000B4</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>INCR_HDPL</name>
                <description>increment HDPL value
Other: all other values allow a HDPL level increment.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0xB4</name>
                    <description>no increment</description>
                    <value>0xB4</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x6A</name>
                    <description>recommended value to increment HDPL level by one</description>
                    <value>0x6A</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>SBS_HDPLSR</name>
            <displayName>SBS_HDPLSR</displayName>
            <description>SBS temporal isolation status register</description>
            <addressOffset>0x014</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00000000</resetMask>
            <fields>
              <field>
                <name>HDPL</name>
                <description>temporal isolation level
This bitfield returns the current temporal isolation level.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0xB4</name>
                    <description>HDPL0, RSS</description>
                    <value>0xB4</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x51</name>
                    <description>HDPL1, iRoT</description>
                    <value>0x51</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x8A</name>
                    <description>HDPL2, uRoT</description>
                    <value>0x8A</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x6F</name>
                    <description>HDPL3, application</description>
                    <value>0x6F</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>SBS_DBGCR</name>
            <displayName>SBS_DBGCR</displayName>
            <description>SBS debug control register</description>
            <addressOffset>0x020</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>AP_UNLOCK</name>
                <description>access port unlock
Write 0xB4 to this bitfield to open the device access port.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DBG_UNLOCK</name>
                <description>debug unlock when DBG_AUTH_HDPL is reached
Write 0xB4 to this bitfield to open the debug when HDPL in SBS_HDPLSR equals to DBG_AUTH_HDPL in this register.</description>
                <bitOffset>8</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DBG_AUTH_HDPL</name>
                <description>authenticated debug temporal isolation level
Writing to this bitfield defines at which HDPL the authenticated debug opens.
Note: Writing any other values is ignored. Reading any other value means the debug never opens.</description>
                <bitOffset>16</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x51</name>
                    <description>HDPL1</description>
                    <value>0x51</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x8A</name>
                    <description>HDPL2</description>
                    <value>0x8A</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x6F</name>
                    <description>HDPL3</description>
                    <value>0x6F</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>SBS_DBGLOCKR</name>
            <displayName>SBS_DBGLOCKR</displayName>
            <description>SBS debug lock register</description>
            <addressOffset>0x024</addressOffset>
            <size>0x20</size>
            <resetValue>0x000000B4</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>DBGCFG_LOCK</name>
                <description>debug configuration lock
Reading this bitfield returns 0x6A if the bitfield value is different from 0xB4.
0xC3 is the recommended value to lock the debug configuration using this bitfield.
Other: Writes to SBS_DBGCR ignored</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0xB4</name>
                    <description>Writes to SBS_DBGCR allowed (default)</description>
                    <value>0xB4</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>SBS_PMCR</name>
            <displayName>SBS_PMCR</displayName>
            <description>SBS product mode and configuration register</description>
            <addressOffset>0x100</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>BOOSTEN</name>
                <description>booster enable
Set this bit to reduce the total harmonic distortion of the analog switch when the processor supply is below 2.7 V. The booster can be activated to guaranty AC performance on analog switch when the supply is below 2.7 V. When the booster is activated, the analog switch performances are the same as with the full voltage range.</description>
                <bitOffset>8</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>Booster disabled</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Booster enabled</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>BOOSTVDDSEL</name>
                <description>booster V DD  selection
Note: Booster must not be used when V DDA   2.7 V, but V DD   2.7 V (add current consumption).
Note: When both V DD   2.7 V and V DDA   2.7 V, booster is needed to get full AC performances from I/O analog switches.</description>
                <bitOffset>9</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>V DDA  is selected as V BOOSTER  supply (BOOSTE = 0)</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>V DD  is selected as V BOOSTER  supply (regardless BOOSTEN that must be cleared to avoid unwanted power consumption)</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>PB6_FMPLUS</name>
                <description>Fast-mode Plus command on PB(6)</description>
                <bitOffset>16</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>Fast-mode Plus mode on PB(6) is disabled</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Fast-mode Plus mode on PB(6) is enabled</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>PB7_FMPLUS</name>
                <description>Fast-mode Plus command on PB(7)</description>
                <bitOffset>17</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>Fast-mode Plus mode on PB(7) is disabled</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Fast mode plus mode on PB(7) is enabled</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>PB8_FMPLUS</name>
                <description>Fast-mode Plus command on PB(8)</description>
                <bitOffset>18</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>Fast-mode Plus mode on PB(8) is disabled</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Fast-mode Plus mode on PB(8) is enabled</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>SBS_FPUIMR</name>
            <displayName>SBS_FPUIMR</displayName>
            <description>SBS FPU interrupt mask register</description>
            <addressOffset>0x104</addressOffset>
            <size>0x20</size>
            <resetValue>0x0000001F</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>FPU_IE</name>
                <description>FPU interrupt enable
Set and cleared by software to enable the Cortex-M33 FPU interrupts
FPU_IE[5]: inexact interrupt enable (interrupt disabled at reset)
FPU_IE[4]: input abnormal interrupt enable
FPU_IE[3]: overflow interrupt enable
FPU_IE[2]: underflow interrupt enable
FPU_IE[1]: divide-by-zero interrupt enable
FPU_IE[0]: invalid operation interrupt enable</description>
                <bitOffset>0</bitOffset>
                <bitWidth>6</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>SBS_MESR</name>
            <displayName>SBS_MESR</displayName>
            <description>SBS memory erase status register</description>
            <addressOffset>0x108</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>MCLR</name>
                <description>erase after reset status
This bit shows the status of the protection for SRAM2, BKPRAM, ICACHE, ICACHE. It is set by hardware and reset by software</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>Memory erase on going (if not yet cleared by software)</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Memory erase done</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>IPMEE</name>
                <description>end-of-erase status for ICACHE
This bit shows the status of the protection for ICACHE. It is set by hardware and reset by software.</description>
                <bitOffset>16</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>ICACHE erase on going</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>ICACHE erase ended</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>SBS_CCCSR</name>
            <displayName>SBS_CCCSR</displayName>
            <description>SBS compensation cell for I/Os control and status register</description>
            <addressOffset>0x110</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>EN1</name>
                <description>enable compensation cell for VDDIO power rail
This bit enables the I/O compensation cell.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>I/O compensation cell disabled</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>I/O compensation cell enabled</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>CS1</name>
                <description>code selection for VDDIO power rail (reset value set to 1)
This bit selects the code to be applied for the I/O compensation cell.</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>Code from the cell (available in the SBS_CCVR)</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Code from SBS_CCCR</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>EN2</name>
                <description>enable compensation cell for VDDIO2 power rail
This bit enables the I/O compensation cell.</description>
                <bitOffset>2</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>I/O compensation cell disabled</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>I/O compensation cell enabled</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>CS2</name>
                <description>code selection for VDDIO2 power rail (reset value set to 1)
This bit selects the code to be applied for the I/O compensation cell.</description>
                <bitOffset>3</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>Code from the cell (available in SBS_CCVR)</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Code from SBS_CCCR</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>RDY1</name>
                <description>VDDIO compensation cell ready flag
This bit provides the status of the compensation cell.</description>
                <bitOffset>8</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>VDDIO compensation cell not ready</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>VDDIO compensation cell ready (code value provided by the cell can be used)</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>RDY2</name>
                <description>VDDIO2 compensation cell ready flag
This bit provides the status of the VDDIO2 compensation cell.</description>
                <bitOffset>9</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>VDDIO2 compensation cell not ready</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>VDDIO2 compensation cell ready (code value provided by the cell can be used)</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>SBS_CCVALR</name>
            <displayName>SBS_CCVALR</displayName>
            <description>SBS compensation cell for I/Os value register</description>
            <addressOffset>0x114</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000088</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>ANSRC1</name>
                <description>compensation value for the NMOS transistor
This value is provided by the cell and must be interpreted by the processor to compensate the slew rate in the functional range.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>APSRC1</name>
                <description>compensation value for the PMOS transistor
This value is provided by the cell and must be interpreted by the processor to compensate the slew rate in the functional range.</description>
                <bitOffset>4</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>ANSRC2</name>
                <description>Compensation value for the NMOS transistor
This value is provided by the cell and must be interpreted by the processor to compensate the slew rate in the functional range.</description>
                <bitOffset>8</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>APSRC2</name>
                <description>compensation value for the PMOS transistor
This value is provided by the cell and must be interpreted by the processor to compensate the slew rate in the functional range.</description>
                <bitOffset>12</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
